[
    {
        "bookId": 1,
        "bookName": "The Martian",
        "author": "Andy Weir",
        "image": "https://i.ibb.co/L0jw4hK/1-the-martin.jpg",
        "review": "A thrilling tale of survival and ingenuity as an astronaut is stranded alone on Mars. The story captivates with its portrayal of human resilience and problem-solving skills in the face of extreme adversity. Andy Weir's narrative keeps readers on the edge of their seats, blending science and suspense seamlessly.",
        "totalPages": 384,
        "rating": 4.6,
        "category": "Science Fiction",
        "tags": ["Survival", "Science"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2011
      },
    {
      "bookId": 2,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/8c4BFGP/2-cover.jpg",
      "review": "A witty and timeless social commentary on love, class, and societal expectations. Jane Austen's astute observations and memorable characters continue to resonate with readers across generations. The novel's humor and insight into human nature make it a classic of English literature, exploring themes of romance, prejudice, and societal norms.",
      "totalPages": 224,
      "rating": 4.2,
      "category": "Romance",
      "tags": ["Classic", "Satire"],
      "publisher": "Egerton Smith",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 3,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.ibb.co/272x1py/3-1200px-To-Kill-a-Mockingbird-first-edition-cover.jpg",
      "review": "A powerful and moving story about racial injustice in the American South, seen through the eyes of a young girl. Harper Lee's timeless tale confronts themes of morality, empathy, and the consequences of prejudice. The novel's enduring impact stems from its poignant narrative and universal messages of compassion and justice.",
      "totalPages": 324,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["Justice", "Historical"],
      "publisher": "J. B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 4,
      "bookName": "Dune",
      "author": "Frank Herbert",
      "image": "https://i.ibb.co/yN3k70J/4-dune.jpg",
      "review": "A complex and thought-provoking science fiction epic set on a desert planet with a valuable spice. Frank Herbert's masterful world-building and intricate plotlines create a mesmerizing reading experience. 'Dune' delves into themes of politics, ecology, and the human condition, leaving readers pondering its philosophical underpinnings long after the final page.",
      "totalPages": 544,
      "rating": 4.5,
      "category": "Science Fiction",
      "tags": ["Political", "Ecology", "Space"],
      "publisher": "Chilton Books",
      "yearOfPublishing": 1965
    },
    {
      "bookId": 5,
      "bookName": "One Hundred Years of Solitude",
      "author": "Gabriel García Márquez",
      "image": "https://i.ibb.co/z66rpRg/5-100-Years-First.jpg",
      "review": "A magical realist masterpiece that chronicles the rise and fall of a family through generations in a fictional Colombian town. Gabriel García Márquez's lyrical prose and vivid imagery transport readers to a world where reality and myth intertwine. 'One Hundred Years of Solitude' is a timeless exploration of love, destiny, and the human experience.",
      "totalPages": 487,
      "rating": 4.3,
      "category": "Magical Realism",
      "tags": ["History", "Literature"],
      "publisher": "Editorial Sudamericana",
      "yearOfPublishing": 1967
    },
    {
      "bookId": 6,
      "bookName": "The Hitchhiker's Guide to the Galaxy",
      "author": "Douglas Adams",
      "image": "https://i.ibb.co/09mGBbb/6-galaxy.jpg",
      "review": "A hilarious and absurdist science fiction comedy about a man who escapes Earth's destruction with his friend and a sentient towel. Douglas Adams' wit and imagination shine in this intergalactic romp filled with eccentric characters and improbable adventures. 'The Hitchhiker's Guide to the Galaxy' is a delightful journey through the cosmos.",
      "totalPages": 192,
      "rating": 4.4,
      "category": "Science Fiction",
      "tags": ["Comedy", "Space Travel"],
      "publisher": "Pan Books",
      "yearOfPublishing": 1979
    }
  ]
